[
  {
    "title": "General Info",
    "paragraph": "SWAPI: Return of the Jedi is the newest iteration of the Star Wars API. I've built it from the ground up independently. The only thing used from a previous implementation is the json data, which I've since heavily modified and added onto. This new version is built using modern technologies and is designed to be more scalable, performant, maintainable, and user-friendly than its predecessor."
  },
  {
    "title": "Technologies Used",
    "paragraph": "The front-end of the application is built in React with Typescript and MaterialUI, while the back-end is built in FastAPI with Python, coupled with a SQLite database managed with SQLModel. This application is containerized with Docker and deployed to AWS. For front-end testing I use Cypress, and for backend testing I use PyTest."
  },
  {
    "title": "Why I built another SWAPI app",
    "paragraph": "A long time ago, in a galaxy pretty much the same as this one... I was given a take home assignment for a job interview. The task was to create a front-end for the original SWAPI.co. Over the years, I made small updates to that front-end as a portfolio project, migrating to the newer swapi.tech. I always wanted to see human readable responses, images, etc. I also wanted to learn new technologies and improve my skills. So, I decided to build my own version of the API and front-end from scratch."
  },
  {
    "title": "What about swapi.tech?",
    "paragraph": "swapi.tech is still available, and I hope always will be. Preferring to work with a JS API is a good reason to continue using it. Without Swapi.tech and all the work that Ryan Curtis did, my own application wouldn't exist. I have massive gratitude for him."
  },
  {
    "title": "Thank you / credit due",
    "paragraph": "A large thank you to Paul Hallett, the creator of the original SWAPI we've all used over the years. A larger thank you still to Ryan Curtis, the creator of SWAPI:A New Hope, who kept the API alive and well after the old site went down."
  },
  {
    "title": "About Me",
    "paragraph": "I'm Tyren Rhinehart, a full-stack software engineer.Professionally, I've worked the last 6 years building web and mobile applications for a diverse set of clients including startups, law enforcement, enterprise businesses,schools,scientific organizations, and more. After a year of studying and working on portfolio projects, I am once again on the hunt for a job. If you have any leads please contact me! In my free time I enjoy music, martial arts, cars, my dog, and all things nerdy."
  }
]